; domain
(define (domain emergencias)
    (:requirements :strips :typing)
    (:types
        location box bcontent grip person dron - object
    )

    (:predicates
        (at-dron ?d - dron ?l - location) 
        (at-box ?b - box ?l - location)
        (at-person ?p - person ?l - location)
        
        (box-has ?b - box ?c - bcontent)
        (person-has ?p - person ?c - bcontent)
        
        (free ?g - grip)
        (carrying ?d - dron ?g - grip ?b - box)
    )


    (:action move
        :parameters (?from - location ?to - location ?dron - dron)
        :precondition (at-dron ?dron ?from)
        :effect (and (at-dron ?dron ?to)(not(at-dron ?dron ?from)))
    )

    (:action pick
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron)
        :precondition (and (at-dron ?dron ?location)(at-box ?box ?location)(free ?gripper))
        :effect (and (not (at-box ?box ?location))(not (free ?gripper))(carrying ?dron ?gripper ?box))
    )

    (:action leave
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron ?person - person ?content - bcontent)
        :precondition (and (at-dron ?dron ?location)(carrying ?dron ?gripper ?box)(at-person ?person ?location)(box-has ?box ?content))
        :effect (and (at-box ?box ?location)(free ?gripper)(not(carrying ?dron ?gripper ?box))(person-has ?person ?content)(not(box-has ?box ?content)))
    )
)

; problem
(define (problem drone_problem_d1_l16_p16_c16_g16)
(:domain emergencias)
(:objects
	dron1 - dron
	deposito refugio1 refugio2 refugio3 refugio4 refugio5 refugio6 refugio7 refugio8 refugio9 refugio10 refugio11 refugio12 refugio13 refugio14 refugio15 refugio16 - location
	box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 - box
	comida medicina - bcontent
	person1 person2 person3 person4 person5 person6 person7 person8 person9 person10 person11 person12 person13 person14 person15 person16 - person
	dron1-izq dron1-der - grip
)

(:init
	(at-dron dron1 deposito)
	(free dron1-izq)
	(free dron1-der)
	(at-box box1 deposito)
	(box-has box1 comida)
	(at-box box2 deposito)
	(box-has box2 comida)
	(at-box box3 deposito)
	(box-has box3 comida)
	(at-box box4 deposito)
	(box-has box4 comida)
	(at-box box5 deposito)
	(box-has box5 comida)
	(at-box box6 deposito)
	(box-has box6 comida)
	(at-box box7 deposito)
	(box-has box7 comida)
	(at-box box8 deposito)
	(box-has box8 comida)
	(at-box box9 deposito)
	(box-has box9 comida)
	(at-box box10 deposito)
	(box-has box10 comida)
	(at-box box11 deposito)
	(box-has box11 medicina)
	(at-box box12 deposito)
	(box-has box12 medicina)
	(at-box box13 deposito)
	(box-has box13 medicina)
	(at-box box14 deposito)
	(box-has box14 medicina)
	(at-box box15 deposito)
	(box-has box15 medicina)
	(at-box box16 deposito)
	(box-has box16 medicina)
	(at-person person1 refugio15)
	(at-person person2 refugio14)
	(at-person person3 refugio13)
	(at-person person4 refugio9)
	(at-person person5 refugio16)
	(at-person person6 refugio10)
	(at-person person7 refugio16)
	(at-person person8 refugio2)
	(at-person person9 refugio10)
	(at-person person10 refugio16)
	(at-person person11 refugio7)
	(at-person person12 refugio15)
	(at-person person13 refugio8)
	(at-person person14 refugio3)
	(at-person person15 refugio9)
	(at-person person16 refugio12)
)

(:goal (and
	(person-has person1 comida)
	(person-has person3 comida)
	(person-has person4 medicina)
	(person-has person5 comida)
	(person-has person5 medicina)
	(person-has person6 comida)
	(person-has person6 medicina)
	(person-has person8 comida)
	(person-has person9 comida)
	(person-has person9 medicina)
	(person-has person10 comida)
	(person-has person10 medicina)
	(person-has person12 comida)
	(person-has person13 comida)
	(person-has person14 medicina)
	(person-has person15 comida)
))
)

; plan
1. (pick box16 deposito dron1-der dron1)
   deleted: (at-box box16 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box16)
   goals met: 0 of 16
2. (pick box10 deposito dron1-izq dron1)
   deleted: (at-box box10 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box10)
   goals met: 0 of 16
3. (move deposito refugio13 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio13)
   goals met: 0 of 16
4. (leave box10 refugio13 dron1-izq dron1 person3 comida)
   deleted: (carrying dron1 dron1-izq box10) (box-has box10 comida)
   added: (at-box box10 refugio13) (free dron1-izq) (person-has person3 comida)
   goals met: 1 of 16
5. (move refugio13 deposito dron1)
   deleted: (at-dron dron1 refugio13)
   added: (at-dron dron1 deposito)
   goals met: 1 of 16
6. (pick box9 deposito dron1-izq dron1)
   deleted: (at-box box9 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box9)
   goals met: 1 of 16
7. (move deposito refugio2 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio2)
   goals met: 1 of 16
8. (leave box9 refugio2 dron1-izq dron1 person8 comida)
   deleted: (carrying dron1 dron1-izq box9) (box-has box9 comida)
   added: (at-box box9 refugio2) (free dron1-izq) (person-has person8 comida)
   goals met: 2 of 16
9. (move refugio2 deposito dron1)
   deleted: (at-dron dron1 refugio2)
   added: (at-dron dron1 deposito)
   goals met: 2 of 16
10. (pick box8 deposito dron1-izq dron1)
   deleted: (at-box box8 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box8)
   goals met: 2 of 16
11. (move deposito refugio10 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio10)
   goals met: 2 of 16
12. (move refugio10 refugio8 dron1)
   deleted: (at-dron dron1 refugio10)
   added: (at-dron dron1 refugio8)
   goals met: 2 of 16
13. (leave box8 refugio8 dron1-izq dron1 person13 comida)
   deleted: (carrying dron1 dron1-izq box8) (box-has box8 comida)
   added: (at-box box8 refugio8) (free dron1-izq) (person-has person13 comida)
   goals met: 3 of 16
14. (move refugio8 deposito dron1)
   deleted: (at-dron dron1 refugio8)
   added: (at-dron dron1 deposito)
   goals met: 3 of 16
15. (pick box7 deposito dron1-izq dron1)
   deleted: (at-box box7 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box7)
   goals met: 3 of 16
16. (move deposito refugio10 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio10)
   goals met: 3 of 16
17. (move refugio10 refugio3 dron1)
   deleted: (at-dron dron1 refugio10)
   added: (at-dron dron1 refugio3)
   goals met: 3 of 16
18. (leave box16 refugio3 dron1-der dron1 person14 medicina)
   deleted: (carrying dron1 dron1-der box16) (box-has box16 medicina)
   added: (at-box box16 refugio3) (free dron1-der) (person-has person14 medicina)
   goals met: 4 of 16
19. (move refugio3 deposito dron1)
   deleted: (at-dron dron1 refugio3)
   added: (at-dron dron1 deposito)
   goals met: 4 of 16
20. (pick box15 deposito dron1-der dron1)
   deleted: (at-box box15 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box15)
   goals met: 4 of 16
21. (move deposito refugio10 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio10)
   goals met: 4 of 16
22. (leave box7 refugio10 dron1-izq dron1 person6 comida)
   deleted: (carrying dron1 dron1-izq box7) (box-has box7 comida)
   added: (at-box box7 refugio10) (free dron1-izq) (person-has person6 comida)
   goals met: 5 of 16
23. (move refugio10 deposito dron1)
   deleted: (at-dron dron1 refugio10)
   added: (at-dron dron1 deposito)
   goals met: 5 of 16
24. (pick box6 deposito dron1-izq dron1)
   deleted: (at-box box6 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box6)
   goals met: 5 of 16
25. (move deposito refugio10 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio10)
   goals met: 5 of 16
26. (leave box15 refugio10 dron1-der dron1 person6 medicina)
   deleted: (carrying dron1 dron1-der box15) (box-has box15 medicina)
   added: (at-box box15 refugio10) (free dron1-der) (person-has person6 medicina)
   goals met: 6 of 16
27. (move refugio10 deposito dron1)
   deleted: (at-dron dron1 refugio10)
   added: (at-dron dron1 deposito)
   goals met: 6 of 16
28. (pick box14 deposito dron1-der dron1)
   deleted: (at-box box14 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box14)
   goals met: 6 of 16
29. (move deposito refugio10 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio10)
   goals met: 6 of 16
30. (leave box6 refugio10 dron1-izq dron1 person9 comida)
   deleted: (carrying dron1 dron1-izq box6) (box-has box6 comida)
   added: (at-box box6 refugio10) (free dron1-izq) (person-has person9 comida)
   goals met: 7 of 16
31. (move refugio10 deposito dron1)
   deleted: (at-dron dron1 refugio10)
   added: (at-dron dron1 deposito)
   goals met: 7 of 16
32. (pick box5 deposito dron1-izq dron1)
   deleted: (at-box box5 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box5)
   goals met: 7 of 16
33. (move deposito refugio10 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio10)
   goals met: 7 of 16
34. (leave box14 refugio10 dron1-der dron1 person9 medicina)
   deleted: (carrying dron1 dron1-der box14) (box-has box14 medicina)
   added: (at-box box14 refugio10) (free dron1-der) (person-has person9 medicina)
   goals met: 8 of 16
35. (move refugio10 deposito dron1)
   deleted: (at-dron dron1 refugio10)
   added: (at-dron dron1 deposito)
   goals met: 8 of 16
36. (pick box13 deposito dron1-der dron1)
   deleted: (at-box box13 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box13)
   goals met: 8 of 16
37. (move deposito refugio16 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio16)
   goals met: 8 of 16
38. (leave box5 refugio16 dron1-izq dron1 person5 comida)
   deleted: (carrying dron1 dron1-izq box5) (box-has box5 comida)
   added: (at-box box5 refugio16) (free dron1-izq) (person-has person5 comida)
   goals met: 9 of 16
39. (move refugio16 deposito dron1)
   deleted: (at-dron dron1 refugio16)
   added: (at-dron dron1 deposito)
   goals met: 9 of 16
40. (pick box4 deposito dron1-izq dron1)
   deleted: (at-box box4 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box4)
   goals met: 9 of 16
41. (move deposito refugio16 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio16)
   goals met: 9 of 16
42. (leave box13 refugio16 dron1-der dron1 person5 medicina)
   deleted: (carrying dron1 dron1-der box13) (box-has box13 medicina)
   added: (at-box box13 refugio16) (free dron1-der) (person-has person5 medicina)
   goals met: 10 of 16
43. (move refugio16 deposito dron1)
   deleted: (at-dron dron1 refugio16)
   added: (at-dron dron1 deposito)
   goals met: 10 of 16
44. (pick box12 deposito dron1-der dron1)
   deleted: (at-box box12 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box12)
   goals met: 10 of 16
45. (move deposito refugio16 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio16)
   goals met: 10 of 16
46. (leave box4 refugio16 dron1-izq dron1 person10 comida)
   deleted: (carrying dron1 dron1-izq box4) (box-has box4 comida)
   added: (at-box box4 refugio16) (free dron1-izq) (person-has person10 comida)
   goals met: 11 of 16
47. (move refugio16 deposito dron1)
   deleted: (at-dron dron1 refugio16)
   added: (at-dron dron1 deposito)
   goals met: 11 of 16
48. (pick box3 deposito dron1-izq dron1)
   deleted: (at-box box3 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box3)
   goals met: 11 of 16
49. (move deposito refugio16 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio16)
   goals met: 11 of 16
50. (leave box12 refugio16 dron1-der dron1 person10 medicina)
   deleted: (carrying dron1 dron1-der box12) (box-has box12 medicina)
   added: (at-box box12 refugio16) (free dron1-der) (person-has person10 medicina)
   goals met: 12 of 16
51. (move refugio16 deposito dron1)
   deleted: (at-dron dron1 refugio16)
   added: (at-dron dron1 deposito)
   goals met: 12 of 16
52. (pick box11 deposito dron1-der dron1)
   deleted: (at-box box11 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box11)
   goals met: 12 of 16
53. (move deposito refugio15 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio15)
   goals met: 12 of 16
54. (move refugio15 refugio9 dron1)
   deleted: (at-dron dron1 refugio15)
   added: (at-dron dron1 refugio9)
   goals met: 12 of 16
55. (leave box11 refugio9 dron1-der dron1 person4 medicina)
   deleted: (carrying dron1 dron1-der box11) (box-has box11 medicina)
   added: (at-box box11 refugio9) (free dron1-der) (person-has person4 medicina)
   goals met: 13 of 16
56. (leave box3 refugio9 dron1-izq dron1 person15 comida)
   deleted: (carrying dron1 dron1-izq box3) (box-has box3 comida)
   added: (at-box box3 refugio9) (free dron1-izq) (person-has person15 comida)
   goals met: 14 of 16
57. (move refugio9 deposito dron1)
   deleted: (at-dron dron1 refugio9)
   added: (at-dron dron1 deposito)
   goals met: 14 of 16
58. (pick box2 deposito dron1-der dron1)
   deleted: (at-box box2 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box2)
   goals met: 14 of 16
59. (move deposito refugio15 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio15)
   goals met: 14 of 16
60. (leave box2 refugio15 dron1-der dron1 person1 comida)
   deleted: (carrying dron1 dron1-der box2) (box-has box2 comida)
   added: (at-box box2 refugio15) (free dron1-der) (person-has person1 comida)
   goals met: 15 of 16
61. (move refugio15 deposito dron1)
   deleted: (at-dron dron1 refugio15)
   added: (at-dron dron1 deposito)
   goals met: 15 of 16
62. (pick box1 deposito dron1-der dron1)
   deleted: (at-box box1 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box1)
   goals met: 15 of 16
63. (move deposito refugio15 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio15)
   goals met: 15 of 16
64. (leave box1 refugio15 dron1-der dron1 person12 comida)
   deleted: (carrying dron1 dron1-der box1) (box-has box1 comida)
   added: (at-box box1 refugio15) (free dron1-der) (person-has person12 comida)
   goals met: 16 of 16
